---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotApplyGridSpecification
source: html/c395b525-ac89-eeff-f8f9-563696385fa9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotApplyGridSpecification Property

It is not possible to apply the host family's grid specification to this instance.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotApplyGridSpecification { get; }
```